In [1]:
def define_func():
    return "This is demo"

define_func()

'This is demo'

In [2]:
import math
class Point:
    def __init__(self,X,Y) :
        self.x=X
        self.y = Y
    
    def get_x(self) :
        return self.x
    def get_y(self):
        return self.y

    def distance_from_origin(self):
        return ((self.x)**2) + ((self.y))**0.5
    
    def distance(point1,point2):
        xdiff = point2.get_x() - point1.get_x()
        ydiff = point2.get_y() - point1.get_y()

        distance = math.sqrt(xdiff**2 - ydiff**2)

        return distance

    def __str__(self):
        return f'This is a point class where x = {self.x} , y= {self.y}'

In [3]:
integer_list = [Point(1,5),Point(2,4),Point(0,3),Point(2,3)]

integer_list

[<__main__.Point at 0x19c3fbf45d0>,
 <__main__.Point at 0x19c3fc1ca90>,
 <__main__.Point at 0x19c3fc1d8d0>,
 <__main__.Point at 0x19c3fc03cd0>]

In [4]:
for point in integer_list:
    print(point)

This is a point class where x = 1 , y= 5
This is a point class where x = 2 , y= 4
This is a point class where x = 0 , y= 3
This is a point class where x = 2 , y= 3

In [5]:
for  point in sorted(integer_list):
    print(point)

TypeError: '<' not supported between instances of 'Point' and 'Point'

In [7]:
for point in sorted(integer_list,key=lambda x_value:x_value.x):
    print(point)

This is a point class where x = 0 , y= 3
This is a point class where x = 1 , y= 5
This is a point class where x = 2 , y= 4
This is a point class where x = 2 , y= 3

In [8]:
for point in sorted(integer_list,key=Point.get_y):
    print(point)

This is a point class where x = 0 , y= 3
This is a point class where x = 2 , y= 3
This is a point class where x = 2 , y= 4
This is a point class where x = 1 , y= 5

In [9]:
for point in sorted(integer_list,key=Point.get_x):
    print(point)

This is a point class where x = 0 , y= 3
This is a point class where x = 1 , y= 5
This is a point class where x = 2 , y= 4
This is a point class where x = 2 , y= 3

In [10]:
for point in sorted(integer_list,key=lambda y_value:y_value.y):
    print(point)

This is a point class where x = 0 , y= 3
This is a point class where x = 2 , y= 3
This is a point class where x = 2 , y= 4
This is a point class where x = 1 , y= 5

In [12]:
import  pandas as pd 

data = {
    'Date':['2023-09-09','2023-09-01','2023-08-13','2023-05-19'],
    'City' :['New York','Tokyo','Beijing','Mumbai'],
    'Temperature':[23,21,15,35],
    'Humidity':[45,55,12,44]

}

df = pd.DataFrame(data)
df

         Date      City  Temperature  Humidity
0  2023-09-09  New York           23        45
1  2023-09-01     Tokyo           21        55
2  2023-08-13   Beijing           15        12
3  2023-05-19    Mumbai           35        44

In [13]:
pivot_table = df.pivot(index='Date',columns='City',values='Temperature')

pivot_table

City        Beijing  Mumbai  New York  Tokyo
Date
2023-05-19      NaN    35.0       NaN    NaN
2023-08-13     15.0     NaN       NaN    NaN
2023-09-01      NaN     NaN       NaN   21.0
2023-09-09      NaN     NaN      23.0    NaN

In [14]:
pivot_table = df.pivot(index='City',columns='Date',values='Temperature')

pivot_table

Date      2023-05-19  2023-08-13  2023-09-01  2023-09-09
City
Beijing          NaN        15.0         NaN         NaN
Mumbai          35.0         NaN         NaN         NaN
New York         NaN         NaN         NaN        23.0
Tokyo            NaN         NaN        21.0         NaN

In [17]:
# convert into csv

df.to_csv('output.csv',index=False)

print('converted into csv')

converted into csv

In [18]:
data = {
    'columns_to_split' :['value1A_value1B','value2A_value2B','value3A_value3B']

}

df = pd.DataFrame(data)

df

  columns_to_split
0  value1A_value1B
1  value2A_value2B
2  value3A_value3B

In [19]:
column_to_split_series = df['columns_to_split']

column_to_split_series

0    value1A_value1B
1    value2A_value2B
2    value3A_value3B
Name: columns_to_split, dtype: object

In [20]:
seperated_series = column_to_split_series.str.split('_')

seperated_series

0    [value1A, value1B]
1    [value2A, value2B]
2    [value3A, value3B]
Name: columns_to_split, dtype: object

In [22]:
df[['First Column','Second Column']]= pd.DataFrame(seperated_series.tolist(),index=df.index)

df

  columns_to_split First Column Second Column
0  value1A_value1B      value1A       value1B
1  value2A_value2B      value2A       value2B
2  value3A_value3B      value3A       value3B